PedroFnseca/esp32-http-client/tests/test_rest_request.cpp
int main() {
  runSuite("AddParamFormatting", testAddParamFormatting);
  runSuite("ExecuteBuildsUrlAndPayload", testExecuteBuildsUrlAndPayload);
  runSuite("MethodAliases", testMethodAliases);
  runSuite("ParseResponseBindsTypes", testParseResponseBindsTypes);
  runSuite("ParseNestedJSON", testParseNestedJSON);
  runSuite("ParseNestedJSONMissingFields", testParseNestedJSONMissingFields);
  runSuite("ParseRawArrayJSON", testParseRawArrayJSON);
  runSuite("UnixTimestampFetch", testUnixTimestampFetch);
  runSuite("ClientConfiguration", testClientConfiguration);
  runSuite("AllHttpMethods", testAllHttpMethods);
  runSuite("AutoRetry", testAutoRetry);
  runSuite("ChunkedTransferEncoding", testChunkedTransferEncoding);
  runSuite("LargePayloadRefill", testLargePayloadRefill);
  runSuite("MoreParseEdgeCases", testMoreParseEdgeCases);
  runSuite("ParseEmptyObjectOrArray", testParseEmptyObjectOrArray);
  runSuite("AddParamAdvanced", testAddParamAdvanced);
  runSuite("ExecuteCustomPortWithPath", testExecuteCustomPortWithPath);
  runSuite("ParseEscapedStringsSimple", testParseEscapedStringsSimple);
  runSuite("SkipValueAdvanced", testSkipValueAdvanced);
  runSuite("MoveConstructor", testMoveConstructor);
  runSuite("ParsePrimitiveTypes", testParsePrimitiveTypes);
  runSuite("AuthBearer", testAuthBearer);
  runSuite("AuthBasic", testAuthBasic);
  runSuite("AuthApiKey", testAuthApiKey);
  runSuite("AuthEdgeCases", testAuthEdgeCases);
  runSuite("QueryParameters", testQueryParameters);
  runSuite("PathParameters", testPathParameters);
  runSuite("PathAndQueryCombined", testPathAndQueryCombined);
  runSuite("PathEdgeCases", testPathEdgeCases);
  runSuite("RuntimeUrlChange", testRuntimeUrlChange);
  runSuite("Timeout", testTimeout);
  runSuite("MaxRetry", testMaxRetry);
  runSuite("ErrorHandlingAndMessages", testErrorHandlingAndMessages);
  runSuite("Callbacks", testCallbacks);
  runSuite("StructSerializationToJson", testStructSerializationToJson);
  runSuite("StructDeserializationFromJson", testStructDeserializationFromJson);
  runSuite("StructMissingFieldsAndDefaults", testStructMissingFieldsAndDefaults);
  runSuite("StructNullFields", testStructNullFields);
  runSuite("StructRequestBody", testStructRequestBody);
  runSuite("StructResponseBodyGetBody", testStructResponseBodyGetBody);
  runSuite("StructCustomAndExternalMapping", testStructCustomAndExternalMapping);

  const int suitesFailed = suitesRun - suitesPassed;
  const double suitePassRate = suitesRun > 0 ? (100.0 * static_cast<double>(suitesPassed) / static_cast<double>(suitesRun)) : 0.0;
  const double checkPassRate = checks > 0 ? (100.0 * static_cast<double>(passedChecks) / static_cast<double>(checks)) : 0.0;

  std::cout << "\n=== Test Summary ===\n";
  std::cout << "Suites: " << suitesRun << " total | " << suitesPassed << " passed | " << suitesFailed << " failed\n";
  std::cout << "Checks: " << checks << " total | " << passedChecks << " passed | " << failures << " failed\n";
  std::cout << std::fixed << std::setprecision(1);
  std::cout << "Pass rate: " << suitePassRate << "% suites | " << checkPassRate << "% checks\n";

  if (failures == 0) {
    std::cout << "All unit tests passed.\n";
    return 0;
  }

  std::cerr << failures << " test(s) failed.\n";
  return 1;
}
